[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces >= 2) {
-            this._faces = faces;
-        } else {
-            this._faces = 6;
-        }
-        this._distribution = new Map<number, number>();
-        this._last = 0;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller constructor should set _faces to the value passed in if it's greater than or equal to 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: undefined

[Killed] BlockStatement
src/Roller.ts:29:33
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number {
-        if (value >= 1 && value <= this._faces) {
-            this._last = value;
-
-            if (this._distribution.get(value) === undefined) {
-                this._distribution.set(value, 1)
-            } else {
-                this._distribution.set(value, this._distribution.get(value) + 1)
-            }
-
-            return this._last;
-        } else {
-
-            return 0;
-        }
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller class roll() method should return 0 if the value provided is less than 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:30:13
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number {
-        if (value >= 1 && value <= this._faces) {
+        if (false) {
             this._last = value;
 
killedBy: Roller class roll() method should record the roll and return the same value if the value provided is between 1 and the number of faces (inclusive)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 0

[Killed] EqualityOperator
src/Roller.ts:30:13
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number {
-        if (value >= 1 && value <= this._faces) {
+        if (value > 1 && value <= this._faces) {
             this._last = value;
 
killedBy: Roller class roll() method should record the roll and return the same value if the value provided is between 1 and the number of faces (inclusive)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
src/Roller.ts:33:17
         if (value >= 1 && value <= this._faces) {
             this._last = value;
 
-            if (this._distribution.get(value) === undefined) {
+            if (true) {
                 this._distribution.set(value, 1)
             } else {

[Survived] BlockStatement
src/Roller.ts:33:62
         if (value >= 1 && value <= this._faces) {
             this._last = value;
 
-            if (this._distribution.get(value) === undefined) {
-                this._distribution.set(value, 1)
-            } else {
+            if (this._distribution.get(value) === undefined) {} else {
                 this._distribution.set(value, this._distribution.get(value) + 1)
             }

[NoCoverage] BlockStatement
src/Roller.ts:35:20
 
             if (this._distribution.get(value) === undefined) {
                 this._distribution.set(value, 1)
-            } else {
-                this._distribution.set(value, this._distribution.get(value) + 1)
-            }
+            } else {}
 
             return this._last;

[NoCoverage] ArithmeticOperator
src/Roller.ts:36:47
             if (this._distribution.get(value) === undefined) {
                 this._distribution.set(value, 1)
             } else {
-                this._distribution.set(value, this._distribution.get(value) + 1)
+                this._distribution.set(value, this._distribution.get(value) - 1)
             }
 

[Killed] BlockStatement
src/Roller.ts:40:16
             }
 
             return this._last;
-        } else {
-
-            return 0;
-        }
+        } else {}
     }
 
killedBy: Roller class roll() method should return 0 if the value provided is less than 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: undefined

[NoCoverage] BlockStatement
src/Roller.ts:57:41
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number> {
-        return new Map<number, number>(this._distribution);
-        // this._distribution;
-        // new Map<number, number>();
-    }
+    distribution(): Map<number, number> {}
 
 } // end of Roller class
